In [10]:
import numpy as np
import pandas as pd
import random

In [4]:
pd.Series([7,11,13,17])

0     7
1    11
2    13
3    17
dtype: int64

In [5]:
pd.Series([100.0] * 5)

0    100.0
1    100.0
2    100.0
3    100.0
4    100.0
dtype: float64

In [6]:
intrand = []

In [12]:
for i in range(20):
    intrand.append(random.randint(0, 100))

In [13]:
pd.Series(intrand).describe()

count     20.000000
mean      48.400000
std       34.986313
min        1.000000
25%        9.000000
50%       61.000000
75%       74.500000
max      100.000000
dtype: float64

In [14]:
temperatures = pd.Series([98.6, 98.9, 100.2, 97.9], index=['Julie', 'Charlie','Sam', 'Andrea'])

In [15]:
pd.Series(temperatures.to_dict())

Julie       98.6
Charlie     98.9
Sam        100.2
Andrea      97.9
dtype: float64

In [18]:
temperatures = pd.DataFrame({'Maxine': [98.3, 98.9, 97.9], 'James': [98.5, 99.1, 97.8], 'Amanda': [98.9, 99.6, 97.6]})

In [19]:
temperatures = pd.DataFrame({'Maxine': [98.3, 98.9, 97.9], 'James': [98.5, 99.1, 97.8], 'Amanda': [98.9, 99.6, 97.6]}, 
                            index=['Morning', 'Afternoon', 'Evening'])

In [21]:
temperatures.Maxine

Morning      98.3
Afternoon    98.9
Evening      97.9
Name: Maxine, dtype: float64

In [25]:
temperatures

           Maxine  James  Amanda
Morning      98.3   98.5    98.9
Afternoon    98.9   99.1    99.6
Evening      97.9   97.8    97.6

In [27]:
temperatures.loc['Morning']

Maxine    98.3
James     98.5
Amanda    98.9
Name: Morning, dtype: float64

In [29]:
temperatures.loc[['Morning', 'Evening']]

         Maxine  James  Amanda
Morning    98.3   98.5    98.9
Evening    97.9   97.8    97.6

In [31]:
temperatures[['Amanda', 'Maxine']]

           Amanda  Maxine
Morning      98.9    98.3
Afternoon    99.6    98.9
Evening      97.6    97.9

In [32]:
temperatures[['Amanda', 'Maxine']].loc[['Morning', 'Afternoon']]

           Amanda  Maxine
Morning      98.9    98.3
Afternoon    99.6    98.9

In [33]:
temperatures.describe()

          Maxine      James     Amanda
count   3.000000   3.000000   3.000000
mean   98.366667  98.466667  98.700000
std     0.503322   0.650641   1.014889
min    97.900000  97.800000  97.600000
25%    98.100000  98.150000  98.250000
50%    98.300000  98.500000  98.900000
75%    98.600000  98.800000  99.250000
max    98.900000  99.100000  99.600000

In [34]:
temperatures.transpose()

        Morning  Afternoon  Evening
Maxine     98.3       98.9     97.9
James      98.5       99.1     97.8
Amanda     98.9       99.6     97.6

In [40]:
temperatures[sorted(temperatures.columns)]

           Amanda  James  Maxine
Morning      98.9   98.5    98.3
Afternoon    99.6   99.1    98.9
Evening      97.6   97.8    97.9